NonOffOpenFOAM/FoamCases/ppGrad/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location 	"0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions			[0 2 -2 0 0 0 0];

internalField		uniform 0;

boundaryField
{
	top
	{
		type		zeroGradient;
	}

	bottom
	{
		type		zeroGradient;
	}

	inlet
	{
		type		fixedValue;
		value 		uniform 101.325;
	}

	outlet
	{
		type		fixedValue;
		value 		uniform 0;
	}

	frontAndBack
	{
		type		empty;
	}
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //