NonOffOpenFOAM/FoamCases/ppGrad/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
	default		Euler;
}

gradSchemes
{
	default		Gauss linear;
	grad(p)		Gauss linear;
}

divSchemes
{
	default		none;
	div(phi,U)	Gauss linear;
}

laplacianSchemes
{
	default 	none;
	laplacian(nu,U) Gauss linear orthogonal;
	laplacian((1|A(U)),p) Gauss linear orthogonal;

}

interpolationSchemes
{
	default 			linear;
	interpolate(HbyA) 	linear;

}

snGradSchemes
{
	default 	orthogonal;

}

fluxRequired
{
	default 	no;
	p 			;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //